app/views/links/index.html.erb

      <%= link_to link.title, link %><br>
      <small class="author">Submitted <%= time_ago_in_words(link.created_at) %> by <% if link.user.name != nil && !link.user.name.empty? %><%= link.user.name %> <% else %><%= link.user.email%><%end%></small>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]