app/views/links/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<div class="page-header">
  <h1><a href="<%= @link.url %>"><%= @link.title %></a><br> <small>Submitted by <% if @link.user.name != nil && !@link.user.name.empty?%><%= @link.user.name %><% else %> <%= @link.user.email%><%end%></small></h1>