app/controllers/links_controller.rb

  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["url", "test"], ["created_at", "2018-03-19 09:44:14.275746"], ["updated_at", "2018-03-19 09:44:14.275746"], ["user_id", 1]]

  def downvote
    @link = Link.find(params[:id]) #üstteki before_action'a :downvote eklemediğimiz için burada bu yazıldı.
    @link.downvote_by current_user
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]